---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures.InvalidPlanRegionError
source: html/bb642b0e-4dd8-2287-2f88-ad20c345ce7b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures.InvalidPlanRegionError Property

Plan region is invalid. The sketch of a plan region may not contain intersecting, overlapping or nested loops.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidPlanRegionError { get; }
```